import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

# Create a dataframe with your data
data = [
	["بۆ", "بۆ", "بۆ", "لۆ", "بۆ"],
	["بێ", "بێ", "بێ", "بی", "بێ"],
	["بە", "بە", "بە", "بە", "بە"],
	["لە", "لە", "لە", "لە", "لە"],
	["بۆ ئێمە", "بۆ ئێمە", "بۆ ئێمە", "لۆ مە", "بۆ مە"],
	["بێ ئێمە", "بێ ئێمە", "بێ ئێمە", "بی مە", "بێ مە"],
	["بە ئێمە", "بە ئێمە", "بە ئێمە", "بە مە", "بە مە"],
	["لە ئێمە", "لە ئێمە", "لە ئێمە", "لە مە", "لە مە"],
	["لەگەڵ", "لەگەڵ", "لەتەک", "لەگەر", "دەگەڵ"],
	["لەگەڵ", "لەگەڵ", "تەک", "لەگەر", "دەگەڵ"],
	["لەگەڵدا", "لەگەڵا", "لەتەکا", "لەگەردا", "دەگەڵدا"],
	["لەگەڵدا", "لەگەڵا", "تەکا", "لەگەردا", "دەگەڵدا"],
	["لەگەڵ ئێمە", "لەگەڵ ئێمە", "لەتەک ئێمە", "لەگەر مە", "دەگەڵ مە"],
	["لەگەڵ ئێمە", "لەگەڵ ئێمە", "لەتەک ئێمە", "لەگەر مە", "ڕەگەڵ مە"],
	["لە لای ئێمە", "لە لای ئێمە", "لە لای ئێمە", "لە کن مە", "لە کن مە"],
	["بۆ ئەوان", "بۆ ئەوان", "بۆ ئەوان", "لۆ وان", "بۆ وان"],
	["بێ ئەوان", "بێ ئەوان", "بێ ئەوان", "بی وان", "بێ وان"],
	["بە ئەوان", "بە ئەوان", "بە ئەوان", "بە وان", "بە وان"],
	["لە ئەوان", "لە ئەوان", "لە ئەوان", "لە وان", "لە وان"],
	["لەگەڵ ئەوان", "لەگەڵ ئەوان", "لەتەک ئەوان", "لەگەر وان", "دەگەڵ وان"],
	["لەگەڵ ئەوان", "لەگەڵ ئەوان", "لەتەک ئەوان", "لەگەر وان", "ڕەگەڵ وان"],
	["لە لای ئەوان", "لە لای ئەوان", "لە لای ئەوان", "لە کن وان", "لە کن وان"],
	["لە لا", "لە لا", "لە لا", "لە کن", "لە کن"],
	["پێ", "پێ", "پێ", "پێ", "پێ"],
	["تێ", "تێ", "تێ", "تێ", "تێ"],
	["بۆ", "بۆ", "بۆ", "بۆ", "بۆ"],
	["لێ ", "لێ ", "لێ ", "لێ ", "لێ "],
	["پێت", "پێو", "پێو", "پێت", "پێت"],
	["پێت", "پێت", "پێت", "پێت", "پێت"],
	["تێت", "تێو", "تێو", "تێت", "تێت"],
	["تێت", "تێت", "تێت", "تێت", "تێت"],
	["بۆت", "بۆو", "بۆت", "بۆت", "بۆت"],
	["بۆت", "بۆت", "بۆت", "بۆت", "بۆت"],
	["لێت", "لێو", "لێو", "لێت", "لێت"],
	["لێت", "لێت", "لێت", "لێت", "لێت"],
	["لەگەڵمدا", "لەگەڵما", "لەتەکما", "لەگەرمدا", "دەگەڵمدا"],
	["لەگەڵمدا", "لەگەڵما", "لەتەکما", "لەگەرمدا", "لەگەڵمدا"],
	["لەگەڵمدا", "لەگەڵما", "لەتەکما", "لەگەرمدا", "ڕەگەڵمدا"],
	["لەگەڵتدا", "لەگەڵتا", "لەتەکتا", "لەگەرتدا", "دەگەڵتدا"],
	["لەگەڵتدا", "لەگەڵتا", "لەتەکتا", "لەگەرتدا", "لەگەڵتدا"],
	["لەگەڵتدا", "لەگەڵتا", "لەتەکتا", "لەگەرتدا", "ڕەگەڵتدا"],
	["لەگەڵیدا", "لەگەڵیا", "لەتەکیا", "لەگەریدا", "دەگەڵیدا"],
	["لەگەڵیدا", "لەگەڵیا", "لەتەکیا", "لەگەریدا", "لەگەڵیدا"],
	["لەگەڵیدا", "لەگەڵیا", "لەتەکیا", "لەگەریدا", "ڕەگەڵیدا"],
	["لەگەڵماندا", "لەگەڵمانا", "لەتەکمانا", "لەگەرماندا", "دەگەڵماندا"],
	["لەگەڵماندا", "لەگەڵمانا", "لەتەکمانا", "لەگەرماندا", "لەگەڵماندا"],
	["لەگەڵماندا", "لەگەڵمانا", "لەتەکمانا", "لەگەرماندا", "ڕەگەڵماندا"],
	["لەگەڵتاندا", "لەگەڵتانا", "لەتەکتانا", "لەگەرتاندا", "دەگەڵتاندا"],
	["لەگەڵتاندا", "لەگەڵتانا", "لەتەکتانا", "لەگەرتاندا", "لەگەڵتاندا"],
	["لەگەڵتاندا", "لەگەڵتانا", "لەتەکتانا", "لەگەرتاندا", "ڕەگەڵتاندا"],
	["لەگەڵیاندا", "لەگەڵیانا", "لەتەکیانا", "لەگەریاندا", "دەگەڵیاندا"],
	["لەگەڵیاندا", "لەگەڵیانا", "لەتەکیانا", "لەگەریاندا", "لەگەڵیاندا"],
	["لەگەڵیاندا", "لەگەڵیانا", "لەتەکیانا", "لەگەریاندا", "ڕەگەڵیاندا"],
	["من", "من", "من", "ئەمن", "ئەمن"],
	["تۆ", "تۆ", "تۆ", "ئەتوو", "ئەتۆ"],
	["ئەو", "ئەو", "ئەو", "ئەو", "ئەو"],
	["ئێمە", "ئێمە", "ئێمە", "ئەمە", "ئەمە"],
	["ئێوە", "ئێوە", "ئێوە", "ئەنگۆ", "ئەنگۆ"],
	["چییە", "چییە", "چەس", "چێ", "چێ"],
	["شت", "شت", "چت", "چشت", "شت"],
	["هین", "هین", "هین", "هەرامە", "وانێک"],
	["ئی", "هی", "هین", "ئی", "ئی"],
	["ئەرێ", "ئەرێ", "ئەرێ", "ئەدی", "ئەدی"],
	["ئەی", "ئەی", "ئەی", "ئەدی", "ئەدی"],
	["بەخوا", "بەخوا", "بەخوا", "بەخوای", "بەخودای"],
	["هەڵمات", "هەڵمات", "هەڵمات", "کەلا", "هەڵمات"],
	["یاخوا", "یاخوا", "یاخوا", "یاخوە", "یاخودا"],
	["ناو", "ناو", "ناو", "نێو", "نێو"],
	["نێو", "ناو", "ناو", "نێو", "نێو"],
	["خۆش", "خۆش", "خوەش", "خۆش", "خۆش"],
	["هەموو", "هەموو", "گشت", "هەموو", "هەموو"],
	["جوان", "جوان", "زەریف", "جوان", "جوان"],
	["جوان", "گەنج", "جوان", "جەوان", "گەنج"],
	["کەی", "کەی", "کەی", "کەنگی", "کەنگێ"],
	["کوا", "کوا", "کوا", "کا", "لە کۆ"],
	["کام", "کام", "کام", "کێهە", "کێهە"],
	["چۆن", "چۆن", "چۆن", "کوو", "چۆن"],
	["جا", "جا", "جا", "ئەوجا", "جا"],
	["ئینجا", "ئینجا", "جا", "ئەوجا", "جا"],
	["چی", "چی", "چە", "چی", "چی"],
	["چی", "چی", "چە", "چ", "چ"],
	["چەند", "چەن", "چەن", "چەند", "چەند"],
	["چەن", "چەن", "چەن", "چەند", "چەند"],
	["هەتا", "هەتا", "هەتا", "هەتا", "هەتا"],
	["هەتا", "هەتا", "تا", "هەتا", "هەتا"],
	["ڕاست", "ڕاس", "ڕاس", "ڕاست", "ڕاست"],
	["ڕاس", "ڕاس", "ڕاس", "ڕاست", "ڕاست"],
	["تێدا", "تیا", "تیا", "تێدا", "تێدا"],
	["پێدا", "پیا", "پیا", "پێدا", "پێدا"],
	["لێدا", "لێیا", "لیا", "پێدا", "پێدا"],
	["وەک", "وەک", "وەک", "وەکی", "وەکوو"],
	["وەکوو", "وەک", "وەک", "وەکی", "وەکوو"],
	["وەکوو", "وەکوو", "وەک", "وەکی", "وەکوو"],
	["وەک", "وەکوو", "وەک", "وەکی", "وەکوو"],
	["خۆم", "خۆم", "خوەم", "خۆم", "خۆم"],
	["بۆخۆم", "بۆخۆم", "بۆخوەم", "بۆخۆم", "بۆخۆم"],
	["چاک", "چاک", "خاس", "چاک", "چاک"],
	["زۆر", "زۆر", "فرە", "زۆر", "زۆر"],
	["هەندێک", "هەنێک", "بەعزێک", "هەندێک", "هەندەک"],
	["تۆزێک", "تۆزێک", "چکێک", "نیسکێک", "تۆزەک"],
	["بڕێک", "بڕێک", "بڕێک", "بڕێک", "بڕەک"],
	["دیکە", "کە", "تر", "دیکە", "دی"],
	["دیکە", "کە", "تر", "دیکە", "دیکە"],
	["گەورە", "گەورە", "گەورە", "گەورە", "گەورە"],
	["درێژ", "درێژ", "درێژ", "درێژ", "درێژ"],
	["ئەستوور", "ئەستوور", "کوڵوفت", "ئەستوور", "ئەستوور"],
	["قورس", "قورس", "قورس", "قورس", "قورس"],
	["بچووک", "بچووک", "بووچک", "بچووک", "بچووک"],
	["ژن", "ژن", "ژن", "ژن", "ژن"],
	["پیاو", "پیاو", "پیاگ", "پیاو", "پیاو"],
	["منداڵ", "مناڵ", "مناڵ", "منداڵ", "منداڵ"],
	["دایک", "دایک", "دایک", "دایک", "داک"],
	["باوک", "باوک", "باوک", "باب", "باب"],
	["چۆلەکە", "چۆلەکە", "مەلووچک", "چۆلەکە", "چۆلەکە"],
	["باڵندە", "باڵندە", "پەلەوەر", "باڵندە", "باڵندە"],
	["گوێ", "گوێ", "گوێچکە", "گۆ", "گۆ"],
	["دەم", "دەم", "دەم", "زار", "زار"],
	["کچ", "کچ", "کەنیشک", "کچ", "کچ"],
	["پێست", "پێس", "پۆس", "پێست", "پێست"],
	["لووت", "لووت", "لووت", "کەپۆ", "کەپوو"],
	["هێلکە", "هێلکە", "هیلکە", "هێلکە", "هێلکە"],
	["پێ", "پێ", "پا", "پێ", "پێ"],
	["زمان", "زمان", "زوان", "زمان", "زمان"],
	["دەست", "دەس", "دەس", "دەست", "دەست"],
	["توێڵ", "توێڵ", "توێڵ", "نێوچاوان", "نێوچاوان"],
	["یەک", "یەک", "یەک", "یەک", "یەک"],
	["دوو", "دوو", "دوو", "دوو", "دوو"],
	["سێ", "سێ", "سێ", "سێ", "سێ"],
	["چوار", "چوار", "چوار", "چوار", "چار"],
	["پێنج", "پێنج", "پەنج", "پێنج", "پێنج"],
	["شەش", "شەش", "شەش", "شەش", "شەش"],
	["حەوت", "حەوت", "حەفت", "حەوت", "حەوت"],
	["هەشت", "هەشت", "هەشت", "هەشت", "هەشت"],
	["نۆ", "نۆ", "نۆ", "نۆ", "نۆ"],
	["دە", "دە", "دە", "دە", "دە"],
	["یازدە", "یانگزە", "یانگزە", "یازدە", "یازدە"],
	["دوازدە", "دوانگزە", "دوانگزە", "دوازدە", "دوازدە"],
	["سێزدە", "سیانگزە", "سیانگزە", "سێزدە", "سێزدە"],
	["چواردە", "چواردە", "چواردە", "چاردە", "چاردە"],
	["پازدە", "پانگزە", "پانگزە", "پازدە", "پازدە"],
	["شازدە", "شانگزە", "شانگزە", "شازدە", "شازدە"],
	["حەڤدە", "حەڤڤە", "حەڤڤە", "حەڤدە", "حەڤدە"],
	["هەژدە", "هەژدە", "هەژدە", "هەژدە", "هەژدە"],
	["نۆزدە", "نۆزدە", "نۆزدە", "نۆزدە", "نۆزدە"],
	["بیست", "بیس", "بیس", "بیست", "بیست"],
	["شەست", "شەس", "شەس", "شێست", "شێست"],
	["سەت", "سە", "سە", "سەت", "سەت"],
	["بێ", "بێ", "بێ", "بی", "بێ"],
	["بێت", "بێت", "بێت", "بی", "بێ"],
	["نیت", "نیت", "نیت", "نی", "نی"],
	["وەرە", "وەرە", "بێ", "وەرە", "وەرە"],
	["نییە", "نییە", "نییە", "نێ", "نێ"],
	["هەمە", "هەمە", "هەسم", "هەمە", "هەمە"],
	["هەتە", "هەتە", "هەست", "هەتە", "هەتە"],
	["هەیەتی", "هەیەتی", "هەسی", "هەیەتی", "هەیەتی"],
	["هەمانە", "هەمانە", "هەسمان", "هەمانە", "هەمانە"],
	["هەتانە", "هەتانە", "هەستان", "هەتانە", "هەتانە"],
	["هەیانە", "هەیانە", "هەسیان", "هەیتیان", "هەیانە"],
	["هەیە", "هەیە", "هەس", "هەیە", "هەیە"],
	["ئەتوانێ", "ئەتوانێ", "ئەتوانێ", "دەتانێ", "دەتوانێ"],
	["ئەڵێم", "ئەڵێم", "ئەیژم", "دەرێم", "دەڵێم"],
	["ئەڵێی", "ئەڵێی", "ئەیژی", "دەرێی", "دەڵێی"],
	["ئەڵێ", "ئەڵێ", "ئەیژێ", "دەرێ", "دەڵێ"],
	["ئەڵێین", "ئەڵێین", "ئەیژین", "دەرێین", "دەڵێین"],
	["ئەڵێن", "ئەڵێن", "ئەیژن", "دەرێن", "دەڵێن"],
	["وتم", "وتم", "وتم", "گۆتم", "کوتم"],
	["وتت", "وتت", "وتت", "گۆتت", "کوتت"],
	["وتی", "وتی", "وتی", "گۆتی", "کوتی"],
	["وتمان", "وتمان", "وتمان", "گۆتمان", "کوتمان"],
	["وتتان", "وتتان", "وتتان", "گۆتتان", "کوتتان"],
	["وتیان", "وتیان", "وتیان", "گۆتیان", "کوتیان"],
	["بڵێ", "بڵێ", "بێژە", "برێ", "بڵێ"],
	["بڵێن", "بڵێن", "بێژن", "برێن", "بڵێن"],
	["دەتوانێ", "ئەتوانێ", "ئەتوانێ", "دەتانێ", "دەتوانێ"],
	["دەڵێم", "ئەڵێم", "ئەیژم", "دەرێم", "دەڵێم"],
	["دەڵێی", "ئەڵێی", "ئەیژی", "دەرێی", "دەڵێی"],
	["دەڵێ", "ئەڵێ", "ئەیژێ", "دەرێ", "دەڵێ"],
	["دەڵێین", "ئەڵێین", "ئەیژین", "دەرێین", "دەڵێین"],
	["دەڵێن", "ئەڵێن", "ئەیژن", "دەرێن", "دەڵێن"],
	["کوتم", "وتم", "وتم", "گۆتم", "کوتم"],
	["کوتت", "وتت", "وتت", "گۆتت", "کوتت"],
	["کوتی", "وتی", "وتی", "گۆتی", "کوتی"],
	["کوتمان", "وتمان", "وتمان", "گۆتمان", "کوتمان"],
	["کوتتان", "وتتان", "وتتان", "گۆتتان", "کوتتان"],
	["کوتیان", "وتیان", "وتیان", "گۆتیان", "کوتیان"],
	["بڵێ", "بڵێ", "بێژە", "برێ", "بڵێ"],
	["بڵێن", "بڵێن", "بێژن", "برێن", "بڵێن"],
	["دەمەوێ", "ئەمەوێ", "گەرەکمە", "دەمهەوێ", "دەمهەوێ"],
	["دەمەوێت", "ئەمەوێت", "گەرەکمە", "دەمهەوێت", "دەمهەوێت"],
	["خووشک", "خوووشک", "خوێشک", "خوشک", "خووشک"],
	["دەبم", "ئەبم", "ئەوم", "دەبم", "دەبم"],
	["دەبی", "ئەبی", "ئەوی", "دەبی", "دەبی"],
	["دەبێ", "ئەبێ", "ئەوێ", "دەبیتن", "دەبێ"],
	["دەبین", "ئەبین", "ئەوین", "دەبین", "دەبین"],
	["دەبن", "ئەبن", "ئەون", "دەبن", "دەبن"],
	["نابم", "نابم", "ناوم", "نابم", "نابم"],
	["نابی", "نابی", "ناوی", "نابی", "نابی"],
	["نابێ", "نابێ", "ناوێ", "نابیتن", "نابێ"],
	["نابین", "نابین", "ناوین", "نابین", "نابین"],
	["نابن", "نابن", "ناون", "نابن", "نابن"],
	["قوڕ", "قوڕ", "هەڕگ", "قوڕ", "قوڕ"]
]

vector = {"std" :{"sl": 0, "sn": 0, "er": 0, "mh": 0}, "sl": {"sn": 0, "er": 0, "mh": 0}, "sn": {"er": 0, "mh": 0}, "er": {"mh": 0}}
for i in data:
	if i[0] == i[1]:
		 vector["std"]["sl"] += 1
	if i[0] == i[2]:
		 vector["std"]["sn"] += 1
	if i[0] == i[3]:
		 vector["std"]["er"] += 1
	if i[0] == i[4]:
		 vector["std"]["mh"] += 1
	if i[1] == i[2]:
		 vector["sl"]["sn"] += 1
	if i[1] == i[3]:
		 vector["sl"]["er"] += 1
	if i[1] == i[4]:
		 vector["sl"]["mh"] += 1
	if i[2] == i[3]:
		 vector["sn"]["er"] += 1
	if i[2] == i[4]:
		 vector["sn"]["mh"] += 1
	if i[3] == i[4]:
		 vector["er"]["mh"] += 1

print(vector)

labels = {"std": "Standard", "sl": "Sulaymaniyah", "sn": "Sanandaj", "er": "Erbil", "mh": "Mahabad"}

df = pd.DataFrame(vector).fillna(0)

df = df.rename(columns=labels, index=labels)

percentage_df = (df / 201) * 100

mask = np.triu(np.ones(df.shape), k=1)

sns.set(font_scale=1.2)
plt.figure(figsize=(10, 6))

heatmap = sns.heatmap(percentage_df, cmap="YlGnBu", annot=True, fmt=".2f", cbar=True, annot_kws={"size": 12}, mask=mask)

plt.savefig("dialect_similarity_heatmap.pdf")
plt.show()

